# IFCGuidKey Constructor (IFCGuidKey)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGuidKey Constructor (IFCGuidKey)
IFCGuidKey Class See Also
---
IFCGuidKey can be used in managed code as well as unmanaged.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IFCGuidKey(
	IFCGuidKey other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As IFCGuidKey _
)
```

Visual C++
---
```text
public:
IFCGuidKey(
	IFCGuidKey^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.IFC..::..IFCGuidKey
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCGuidKey Class
IFCGuidKey Overload
Autodesk.Revit.DB.IFC Namespace